package cn.fetech.sanyi.data;

/**
 * Created by qianjujun on 2015/7/2 0002 13:16.
 * qianjujun@163.com
 */
public class Data {

   static String FIRSTNAME = "赵 钱 孙 李 周 吴 郑 王 冯 陈 褚 卫 \n" +
            "蒋 沈 韩 杨 朱 秦 尤 许 何 吕 施 张 \n" +
            "孔 曹 严 华 金 魏 陶 姜 戚 谢 邹 喻 \n" +
            "柏 水 窦 章 云 苏 潘 葛 奚 范 彭 郎 \n" +
            "鲁 韦 昌 马 苗 凤 花 方 俞 任 袁 柳 \n" +
            "酆 鲍 史 唐 费 廉 岑 薛 雷 贺 倪 汤 \n" +
            "滕 殷 罗 毕 郝 邬 安 常 乐 于 时 傅 \n" +
            "皮 卞 齐 康 伍 余 元 卜 顾 孟 平 黄 \n" +
            "和 穆 萧 尹 姚 邵 湛 汪 祁 毛 禹 狄 \n" +
            "米 贝 明 臧 计 伏 成 戴 谈 宋 茅 庞 \n" +
            "熊 纪 舒 屈 项 祝 董 梁 杜 阮 蓝 闵 \n" +
            "席 季 麻 强 贾 路 娄 危 江 童 颜 郭 \n" +
            "梅 盛 林 刁 锺 徐 邱 骆 高 夏 蔡 田 \n" +
            "樊 胡 凌 霍 虞 万 支 柯 昝 管 卢 莫 \n" +
            "经 房 裘 缪 干 解 应 宗 丁 宣 贲 邓 \n" +
            "郁 单 杭 洪 包 诸 左 石 崔 吉 钮 龚 \n" +
            "程 嵇 邢 滑 裴 陆 荣 翁 荀 羊 於 惠 \n" +
            "甄 麴 家 封 芮 羿 储 靳 汲 邴 糜 松 \n" +
            "井 段 富 巫 乌 焦 巴 弓 牧 隗 山 谷 \n" +
            "车 侯 宓 蓬 全 郗 班 仰 秋 仲 伊 宫 \n" +
            "宁 仇 栾 暴 甘 钭 历 戎 祖 武 符 刘 \n" +
            "景 詹 束 龙 叶 幸 司 韶 郜 黎 蓟 溥 \n" +
            "印 宿 白 怀 蒲 邰 从 鄂 索 咸 籍 赖 \n" +
            "卓 蔺 屠 蒙 池 乔 阳 郁 胥 能 苍 双 \n" +
            "闻 莘 党 翟 谭 贡 劳 逄 姬 申 扶 堵 \n" +
            "冉 宰 郦 雍 却 璩 桑 桂 濮 牛 寿 通 \n" +
            "边 扈 燕 冀 僪 浦 尚 农 温 别 庄 晏 \n" +
            "柴 瞿 阎 充 慕 连 茹 习 宦 艾 鱼 容 \n" +
            "向 古 易 慎 戈 廖 庾 终 暨 居 衡 步 \n" +
            "都 耿 满 弘 匡 国 文 寇 广 禄 阙 东 \n" +
            "欧 殳 沃 利 蔚 越 夔 隆 师 巩 厍 聂 \n" +
            "晁 勾 敖 融 冷 訾 辛 阚 那 简 饶 空 \n" +
            "曾 毋 沙 乜 养 鞠 须 丰 巢 关 蒯 相 \n" +
            "查 后 荆 红 游 竺 权 逮 盍 益 桓 公";


    static String name = "梦琪、忆柳、之桃、慕青、问兰、尔岚、元香、初夏、沛菡、傲珊\n" +
            "　　曼文、乐菱、痴珊、恨玉、惜文、香寒、新柔、语蓉、海安、夜蓉\n" +
            "　　涵柏、水桃、醉蓝、春儿、语琴、从彤、傲晴、语兰、又菱、碧彤\n" +
            "　　元霜、怜梦、紫寒、妙彤、曼易、南莲、紫翠、雨寒、易烟、如萱\n" +
            "　　若南、寻真、晓亦、向珊、慕灵、以蕊、寻雁、映易、雪柳、孤岚\n" +
            "　　笑霜、海云、凝天、沛珊、寒云、冰旋、宛儿、绿真、盼儿、晓霜\n" +
            "　　碧凡、夏菡、曼香、若烟、半梦、雅绿、冰蓝、灵槐、平安、书翠\n" +
            "　　翠风、香巧、代云、梦曼、幼翠、友巧、听寒、梦柏、醉易、访旋\n" +
            "　　亦玉、凌萱、访卉、怀亦、笑蓝、春翠、靖柏、夜蕾、冰夏、梦松\n" +
            "　　书雪、乐枫、念薇、靖雁、寻春、恨山、从寒、忆香、觅波、静曼\n" +
            "　　凡旋、以亦、念露、芷蕾、千兰、新波、代真、新蕾、雁玉、冷卉\n" +
            "　　紫山、千琴、恨天、傲芙、盼山、怀蝶、冰兰、山柏、翠萱、乐丹\n" +
            "　　翠柔、谷山、之瑶、冰露、尔珍、谷雪、乐萱、涵菡、海莲、傲蕾\n" +
            "　　青槐、冬儿、易梦、惜雪、宛海、之柔、夏青、亦瑶、妙菡、春竹\n" +
            "　　紫蓝、晓巧、幻柏、访蕊、南春、芷蕊、凡蕾、凡柔、安蕾、天荷\n" +
            "　　含玉、书兰、雅琴、书瑶、春雁、从安、夏槐、念芹、怀萍、代曼\n" +
            "　　幻珊、谷丝、秋翠、白晴、海露、代荷、含玉、书蕾、听白、访琴\n" +
            "　　灵雁、秋春、雪青、乐瑶、含烟、涵双、平蝶、雅蕊、傲之、灵薇\n" +
            "　　绿春、含蕾、从梦、从蓉、初丹。听兰、听蓉、语芙、夏彤、凌瑶\n" +
            "　　忆翠、幻灵、怜菡、紫南、依珊、妙竹、访烟、怜蕾、映寒、友绿\n" +
            "　　冰萍、惜霜、凌香、芷蕾、雁卉、迎梦、元柏、代萱、紫真、千青\n" +
            "　　凌寒、紫安、寒安、怀蕊、秋荷、涵雁、以山、凡梅、盼曼、翠彤\n" +
            "　　谷冬、新巧、冷安、千萍、冰烟、雅阳、友绿、南松、诗云、书芹\n" +
            "　　曼荷、笑珊、寒珊、谷南、慕儿、夏岚、友儿、小萱、紫青、妙菱\n" +
            "　　冬寒、曼柔、语蝶、青筠、夜安、觅海、问安、晓槐、雅山、访云\n" +
            "　　翠容、寒凡、晓绿、以菱、冬云、含玉、访枫、含卉、夜白、灵竹\n" +
            "　　醉薇、元珊、幻波、盼夏、元瑶、迎曼、水云、访琴、谷波、乐之\n" +
            "　　笑白、之山、妙海、紫霜、平夏、凌旋、孤丝、怜寒、向萍、凡松\n" +
            "　　白薇、梦菡、飞绿、如波、又晴、友易、香菱、冬亦、问雁、妙春\n" +
            "　　海冬、半安、平春、幼柏、秋灵、凝芙、念烟、白山、从灵、尔芙";


    static String[] fullName;

    static {
        FIRSTNAME = FIRSTNAME.trim();

        name = name.trim();

        fullName = name.split("、");
    }
}
